# ViewExportingEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewExportingEventArgs Class
Members See Also
---
The event arguments used by the ViewExporting event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class ViewExportingEventArgs : RevitAPIPreDocEventArgs
```

Visual Basic
---
```text
Public Class ViewExportingEventArgs _
	Inherits RevitAPIPreDocEventArgs
```

Visual C++
---
```text
public ref class ViewExportingEventArgs : public RevitAPIPreDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreDocEventArgs Autodesk.Revit.DB.Events..::..ViewExportingEventArgs
# See Also
ViewExportingEventArgs Members
Autodesk.Revit.DB.Events Namespace